//  Напишите программу, которая выводит массив из 8 элементов, заполненный нулями и единицами в случайном порядке
// int[] array = new int[size];
/*
int[] CreateRandomArray(int size)
{
    int[] array = new int[size];
    for (int i = 0; i< size; i++)
    {
        array[i] = new Random().Next(0, 2);
    }
    return array;
}
void ShowArray(int[] array)
{
    Console.Write("[  ");
    for (int i = 0; i < array.Length; i++)
    {
        Console.Write(array[i] + " ");    
    }
    Console.Write(" ]");
}
Console.Write("Введите количество элементов массива: ");
int size = Convert.ToInt32(Console.ReadLine());
ShowArray(CreateRandomArray(size));
*/

